# Pandas Exercises

## Setup and Importing

### 1. Import Libraries

Before you begin you should import the two main data manipulation libraries for Python.

Note: Be sure to use their common aliases

In [21]:
import numpy as np
import pandas as pd

sam_filepath = "C:/ddimil/lessons/Pandas/data/payers.csv"
brooks_filepath = "C:/ddimil/DDI Lessons/data/payers.csv"

### 2. Importing from different sources

In the following blocks you will create a pandas dataframe and you will save that dataframe to a variable named ```df```. After each import, you should use another Pandas function to view your dataframe to ensure that it was imported correctly.

#### Import and view from CSV

In [23]:
df = pd.read_csv(brooks_filepath)
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### Import and view from Excel

In [ ]:
df = pd.read_excel("C:/ddimil/lessons/Pandas/data/payers.xlsx")
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.840,2015-12-22 21:19:23.417,NaT,NaN,0,Card,NaN
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205,NaT,NaT,NaN,0,Card,NaN
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.949,2016-01-05 22:54:01.211,NaT,NaN,0,Card,NaN
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.954,2016-01-14 19:05:16.639,NaT,NaN,0,Card,NaN
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.846,2016-01-26 23:25:43.269,NaT,NaN,0,Card,NaN

#### Import and view from JSON

In [ ]:
df = pd.read_json("C:/ddimil/lessons/Pandas/data/payers.json")
df.head()

,address,bill_day,company_name,created_at,deleted_at,email,id,intacct_id,name,notes,source,updated_at
0,None,0,Weissnat Group,2015-12-21 17:00:25.839697,NaT,constantin@example.net,1038,None,Parisian,NaN,Card,2015-12-22 21:19:23.416702
1,None,0,Bogisich and Bogisich Group,2016-02-12 00:52:30.205216,NaT,susana@example.org,1178,None,Cormier,NaN,Card,NaT
2,None,0,Schultz and Hane and Sons,2015-07-01 22:19:34.948958,NaT,bailey@example.org,45,None,Hilpert,NaN,Card,2016-01-05 22:54:01.211366
3,None,0,Lowe and Raynor Group,2016-01-13 20:00:45.953792,NaT,torey@example.com,1084,None,Olson,NaN,Card,2016-01-14 19:05:16.638872
4,None,0,Dooley and Schumm Group,2016-01-12 20:22:40.846050,NaT,felicia@example.org,1077,None,Pfannerstill,NaN,Card,2016-01-26 23:25:43.269280

### 3. Different ways to preview dataset

There are three main methods in python to get a quick preview of your dataset. One method views the top rows, another method views the bottom rows, and the final method views a random sample of rows. Please re-import the CSV file as ```df``` and demonstrate all three methods.

In [ ]:
import numpy as np
import pandas as pd

sam_filepath = "C:/ddimil/lessons/Pandas/data/payers.csv"
brooks_filepath = "C:/ddimil/DDI Lessons/data/payers.csv"
df = pd.read_csv(brooks_filepath)
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### View top rows

In [ ]:
df.head()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier,NaN,2016-02-12 00:52:30.205216,NaN,NaN,NaN,0,Card,NaN,24870.32
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.26928,NaN,NaN,0,Card,NaN,46005.43

#### View bottom rows

In [ ]:
df.tail()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
4329,4396,mable@example.net,Macejkovic and Terry and Sons,Koepp,NaN,2019-11-11 17:24:02.740492,2019-11-11 18:14:07.35787,NaN,NaN,0,StripeACH,NaN,5163.52
4330,4338,amely@example.org,Bahringer and Willms and Sons,Windler,NaN,2019-09-23 20:43:18.840344,2019-11-11 18:19:56.855298,NaN,NaN,0,Card,NaN,43291.75
4331,4398,aron@example.org,Hettinger and Sons,Gulgowski,NaN,2019-11-13 17:57:42.630953,2019-11-20 14:07:00.968375,NaN,NaN,0,Card,NaN,38760.29
4332,4381,thurman@example.com,Bernhard Inc,Bailey,NaN,2019-10-24 22:23:44.647668,2019-12-09 20:01:10.594901,NaN,NaN,0,Card,NaN,45314.00
4333,4403,meda@example.net,Bauch and Schmidt and Sons,Bernhard,NaN,2019-12-27 22:52:03.629465,2020-01-07 19:30:57.121667,NaN,NaN,0,Card,NaN,28621.20

#### View random rows

In [ ]:
df.sample()

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
839,608,alaina@example.org,McCullough LLC,Thompson,NaN,2015-09-14 18:32:22.682081,NaN,NaN,NaN,0,Card,NaN,27985.44

How would you change the number or rows that are being viewed in each of these methods? Below, view a random sample of 20 rows.

#### View 10 random rows

In [ ]:
df.sample(10)

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
3796,3876,julio@example.org,Legros and Wintheiser and Sons,Fahey,NaN,2018-11-01 16:37:28.852681,2018-11-04 20:19:11.157001,NaN,NaN,0,Card,NaN,1385.49
1217,1248,jett@example.net,O'Connell and Leuschke Inc,Ankunding,NaN,2016-03-09 23:46:29.319076,NaN,NaN,NaN,0,Card,NaN,5782.40
3645,3677,shayna@example.net,Abernathy and Sons,Howe,NaN,2018-07-17 16:26:37.709308,2018-08-13 16:17:49.55202,NaN,NaN,0,Card,NaN,41736.68
1591,1675,neha@example.com,Willms and Sons,Turner,NaN,2016-08-25 21:18:16.593542,NaN,NaN,NaN,0,Card,NaN,5324.07
3675,3752,domenico@example.org,Littel and Bayer LLC,MacGyver,NaN,2018-08-21 16:00:41.189428,2018-08-21 21:48:09.716512,NaN,NaN,0,Card,NaN,4286.31
1424,1500,mae@example.net,Wunsch Group,Ruecker,NaN,2016-06-27 23:06:58.643452,2016-06-28 01:08:17.914162,NaN,NaN,0,Card,NaN,5944.23
2007,2092,wilburn@example.net,Rodriguez and Sons,Green,NaN,2017-01-10 15:11:13.097776,NaN,NaN,NaN,0,Card,NaN,12131.36
322,155,maryse@example.com,Kohler and Hickle LLC,Schowalter,NaN,2015-07-01 22:19:34.948958,2015-11-23 22:40:16.923998,NaN,NaN,0,Card,NaN,23801.65
3513,3588,mitchell@example.net,Huel and Schmidt Inc,Erdman,NaN,2018-06-04 18:08:34.224491,2018-06-11 17:34:54.714437,NaN,NaN,0,Card,NaN,16242.65
2892,2903,elmo@example.com,Cronin and Deckow Group,Dickens,NaN,2017-08-17 18:27:22.369175,2018-01-08 21:23:08.117523,NaN,NaN,0,Card,NaN,40734.03

#### View 20 random rows

In [ ]:
df.sample(20)

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
4035,4107,callie@example.net,Kiehn and McLaughlin Group,Schimmel,NaN,2019-04-01 20:14:21.045746,2019-04-01 20:59:59.056385,NaN,NaN,0,Card,NaN,12184.71
1747,1807,brenda@example.com,Carroll and Ruecker and Sons,Schroeder,NaN,2016-09-30 01:34:30.091476,2016-11-18 21:18:43.245204,NaN,NaN,0,Card,NaN,12906.09
1021,291,bruce@example.com,Ziemann Group,Prohaska,NaN,2015-07-01 22:19:34.948958,NaN,NaN,NaN,0,Card,NaN,20605.11
58,1183,amara@example.com,Rowe LLC,Buckridge,NaN,2016-02-19 02:01:28.308583,2016-02-22 23:16:23.707422,NaN,NaN,0,Card,NaN,38143.69
887,233,melvina@example.com,Lockman Group,Emmerich,NaN,2015-07-01 22:19:34.948958,2015-07-20 18:14:26.47538,NaN,NaN,0,Card,NaN,10567.32
2984,3042,austin@example.org,Waelchi and Senger and Sons,Schroeder,NaN,2017-10-10 22:41:26.992616,2019-01-08 17:40:29.66532,NaN,NaN,0,ACH,NaN,17650.86
2879,2926,eliezer@example.org,Davis and Sons,Pfeffer,NaN,2017-08-29 14:20:04.061258,2019-02-04 16:25:52.829689,NaN,NaN,0,Card,NaN,29587.41
1496,1570,alysa@example.com,Walter and Sons,Mueller,NaN,2016-07-18 21:38:16.123767,2016-07-20 17:46:17.487614,NaN,NaN,0,Card,NaN,43032.13
3662,3775,rhoda@example.com,Ondricka and Blick and Sons,Flatley,NaN,2018-09-04 20:22:55.822939,2018-09-04 21:02:37.09938,NaN,NaN,0,Card,NaN,9191.76
921,52,glen@example.org,Smith and Murray and Sons,Bailey,NaN,2015-07-01 22:19:34.948958,NaN,NaN,NaN,0,Card,NaN,23980.23
3869,3950,jewell@example.org,Purdy and Durgan LLC,Ruecker,NaN,2019-01-02 20:30:27.94227,NaN,NaN,NaN,0,Card,NaN,39438.18
2991,3080,micaela@example.com,Murphy Group,Huel,NaN,2017-10-27 20:06:35.574665,2017-10-27 21:24:01.950592,NaN,NaN,0,Card,NaN,5068.19
2205,2330,marcelo@example.com,Nader and Stamm and Sons,Walsh,NaN,2017-03-10 16:31:34.193259,2018-07-20 19:43:55.527417,NaN,NaN,0,Check,NaN,37043.07
3085,3159,viviane@example.com,MacGyver and Douglas Inc,Fisher,NaN,2017-12-05 23:10:06.790298,2017-12-07 21:21:16.391695,NaN,NaN,0,Card,NaN,27180.02
4267,4360,myah@example.com,Durgan and Sons,Towne,NaN,2019-10-11 22:09:52.485123,NaN,NaN,NaN,0,Card,NaN,37759.65
3459,3566,florida@example.org,Schumm Group,Jenkins,NaN,2018-05-22 17:23:02.399818,2019-04-05 21:46:30.637667,NaN,NaN,0,Card,NaN,32203.05
978,184,fae@example.net,Howe Group,Hettinger,NaN,2015-07-01 22:19:34.948958,NaN,NaN,NaN,0,Card,NaN,16759.49
1453,1534,garret@example.net,Glover and Swaniawski and Sons,Stark,NaN,2016-07-08 19:03:51.030361,NaN,NaN,NaN,0,Card,NaN,1549.66
1527,1639,thomas@example.org,Rau and D'Amore and Sons,Ward,NaN,2016-08-12 23:06:46.102391,2019-01-24 20:33:47.823101,NaN,NaN,0,Card,NaN,25929.66
3978,4052,ova@example.org,Hermann and Wunsch Group,Robel,NaN,2019-02-25 06:53:11.934042,2019-02-25 19:04:20.196602,NaN,NaN,0,Card,NaN,22619.55

#### View the number or rows and columns in your dataset

In [ ]:
df.shape

(4334, 13)

#### Get basic info about your dataset

In [ ]:
print(df.describe())

print("----------------------------------------------------------")

print(df.info())

                id  notes     bill_day      bill_amt
count  4334.000000    0.0  4334.000000   4334.000000
mean   2223.665436    NaN     0.035072  25557.751387
std    1267.603220    NaN     0.724225  14167.505568
min       1.000000    NaN    -1.000000   1004.320000
25%    1138.250000    NaN     0.000000  13217.625000
50%    2227.500000    NaN     0.000000  25226.240000
75%    3319.750000    NaN     0.000000  38148.070000
max    4404.000000    NaN    15.000000  49999.940000
----------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4334 entries, 0 to 4333
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   id            4334 non-null   int64
 1   email         4334 non-null   object
 2   company_name  4334 non-null   object
 3   name          4334 non-null   object
 4   notes         0 non-null      float64
 5   created_at    4334 non-null   object
 6   updated_at    3459 non-null   object
 7   deleted_at    12 non-null     object
 8   intacct_id    163 non-null    object
 9   bill_day      4334 non-null   int64
 10  source        4334 non-null   object
 11  address       26 non-null     object
 12  bill_amt      4334 non-null   float64
dtypes: float64(2), int64(2), object(9)
memory usage: 440.3+ KB
None

### 3. Simple selecting from a DataFrame

Once you have properly imported your data and you are going to start selecting and transforming it, you should create a copy so you can refer to your untransformed data later.

Note: It can sometimes

#### Create a copy of your original dataframe called df_copy

Remember that you can use both **.loc** and **.iloc** to access either rows or columns in a dataframe.

In [24]:
df_copy = df.copy()

#### Select the 50th row in df_copy

Remember: Python and Pandas both start counting at 0, so the very first row is row index 0. The tenth row is at row index 9. For example ```df_copy.loc[0:9]``` will return 10 rows and ```df_copy.loc[0:10]``` will return 11 rows.

In [ ]:
df_copy.iloc[49]

id                                       2
email                  felicia@example.net
company_name                   Thiel Group
name                              Gislason
notes                                  NaN
created_at      2015-07-01 22:19:34.948958
updated_at      2018-10-30 22:20:04.839051
deleted_at                             NaN
intacct_id                             NaN
bill_day                                 0
source                                Card
address                                NaN
bill_amt                           7156.82
Name: 49, dtype: object

#### Select the 50th row index in df_copy

In [ ]:
df_copy.iloc[50]

id                                    1105
email                    riley@example.net
company_name      Gerlach and Walter Group
name                             O'Connell
notes                                  NaN
created_at      2016-01-19 21:19:36.722309
updated_at      2017-07-10 16:29:05.673215
deleted_at                             NaN
intacct_id                             NaN
bill_day                                 0
source                                Card
address                                NaN
bill_amt                          27157.76
Name: 50, dtype: object

#### Select the row index 100 - 110

In [ ]:
df_copy.iloc[100:111]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
100,610,harry@example.org,Larkin and Sawayn LLC,Lueilwitz,NaN,2015-09-14 18:32:22.682081,2016-09-22 04:24:16.140126,NaN,NaN,0,Card,NaN,26004.88
101,365,adriel@example.net,Wisoky and Leannon Inc,Kohler,NaN,2015-07-20 18:14:26.457837,2016-09-23 04:49:07.476228,NaN,C-00827,0,Card,NaN,48129.01
102,485,belle@example.org,Bauch and Schamberger and Sons,Goldner,NaN,2015-09-08 19:30:31.50149,2017-03-16 15:42:44.10449,NaN,NaN,0,Card,NaN,23657.26
103,616,asha@example.net,Ryan and Robel and Sons,Mraz,NaN,2015-09-14 18:32:22.682081,2019-06-19 19:16:58.634643,NaN,NaN,0,Card,NaN,4580.78
104,475,jacinthe@example.org,Bogan and Rolfson LLC,Weber,NaN,2015-08-31 22:14:16.482632,2016-12-09 16:44:45.463862,NaN,NaN,0,Card,NaN,1728.49
105,448,peter@example.com,Murray and Kuhlman and Sons,Bednar,NaN,2015-08-25 19:52:46.03607,2017-01-31 10:13:37.944792,NaN,NaN,0,Card,NaN,19790.86
106,874,brycen@example.org,Stanton and Feil and Sons,Farrell,NaN,2015-10-07 16:20:38.385503,2017-12-02 05:28:11.795008,NaN,NaN,0,Card,NaN,20258.65
107,813,wendell@example.net,Spinka and Wiza and Sons,Lind,NaN,2015-09-18 16:08:32.796709,2019-04-11 18:14:05.239068,NaN,NaN,0,Card,NaN,23423.54
108,1123,isom@example.net,Nikolaus and Berge Group,Prosacco,NaN,2016-01-26 18:45:01.041246,2019-03-15 21:17:57.921214,NaN,NaN,0,ACH,NaN,12973.68
109,875,arnulfo@example.org,Spencer and Sons,Brown,NaN,2015-10-07 16:44:03.659073,2015-11-23 22:40:14.886076,NaN,NaN,0,Card,NaN,1926.47
110,825,vincent@example.com,Dickens and Cronin Group,Crona,NaN,2015-09-22 15:02:24.065865,2015-11-23 22:40:14.917266,NaN,NaN,0,Card,NaN,27451.80

#### Select the row index for rows 35, 55, 75, and 95

In [ ]:
df_copy.iloc[[35, 55, 75, 95]]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
35,1282,ferne@example.net,Lemke LLC,Bashirian,NaN,2016-03-23 19:06:12.008668,NaN,NaN,NaN,0,Card,NaN,17859.62
55,1065,alvera@example.org,Aufderhar and Jenkins Group,Wisoky,NaN,2016-01-05 22:54:11.550182,2016-01-26 17:32:33.786991,NaN,NaN,0,Card,NaN,33011.34
75,496,rhianna@example.org,Fisher and Mraz Group,Cremin,NaN,2015-09-12 17:21:04.603626,2015-11-23 22:40:17.968251,NaN,NaN,0,Card,NaN,44221.87
95,980,jovany@example.com,Wunsch and Ebert Group,Hills,NaN,2015-11-17 23:46:27.979538,2015-11-24 22:56:16.467175,NaN,NaN,0,Card,NaN,1490.55

#### Select only the "email" column from the dataframe

In [ ]:
df_copy.loc[:, "email"]

0       constantin@example.net
1           susana@example.org
2           bailey@example.org
3            torey@example.com
4          felicia@example.org
                 ...
4329         mable@example.net
4330         amely@example.org
4331          aron@example.org
4332       thurman@example.com
4333          meda@example.net
Name: email, Length: 4334, dtype: object

#### Select column "id" through column "name"

In [ ]:
df_copy.loc[:, "id":"name"]

,id,email,company_name,name
0,1038,constantin@example.net,Weissnat Group,Parisian
1,1178,susana@example.org,Bogisich and Bogisich Group,Cormier
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert
3,1084,torey@example.com,Lowe and Raynor Group,Olson
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill
...,...,...,...,...
4329,4396,mable@example.net,Macejkovic and Terry and Sons,Koepp
4330,4338,amely@example.org,Bahringer and Willms and Sons,Windler
4331,4398,aron@example.org,Hettinger and Sons,Gulgowski
4332,4381,thurman@example.com,Bernhard Inc,Bailey
4333,4403,meda@example.net,Bauch and Schmidt and Sons,Bernhard

#### Select all rows from the columns "email", "name", and "bill_amt"

In [ ]:
df_copy.loc[:, ["email", "name", "bill_amt"]]

                       email          name  bill_amt
0     constantin@example.net      Parisian  40185.76
1         susana@example.org       Cormier  24870.32
2         bailey@example.org       Hilpert  11669.36
3          torey@example.com         Olson  35833.24
4        felicia@example.org  Pfannerstill  46005.43
...                      ...           ...       ...
4329       mable@example.net         Koepp   5163.52
4330       amely@example.org       Windler  43291.75
4331        aron@example.org     Gulgowski  38760.29
4332     thurman@example.com        Bailey  45314.00
4333        meda@example.net      Bernhard  28621.20

[4334 rows x 3 columns]

#### Select row indexes 10, 15, 21, and 71 with only the columns "id", "name",  and "source"

In [ ]:
df_copy.loc[[10, 15, 21, 71], ["id", "name", "source"]]

      id      name source
10  1170   Rolfson   Card
15   602  Schiller   Card
21     6    Rogahn   Card
71   255      West   Card

### 4. Conditional selection

#### Create a boolean mask for "bill_amt" less than 35000

In [28]:
import numpy as np
import pandas as pd

mask = df_copy.loc[:, "bill_amt"] < 35000
print(mask)

0       False
1        True
2        True
3       False
4       False
        ...
4329     True
4330    False
4331    False
4332    False
4333     True
Name: bill_amt, Length: 4334, dtype: bool

#### Use boolean mask to get those rows which have "bill_amt" less than 3500

In [30]:
df_copy[df_copy.loc[:, "bill_amt"] < 3500]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
33,578,althea@example.com,Stehr and Sons,Price,NaN,2015-09-14 18:32:22.682081,2016-03-04 08:30:10.059792,NaN,NaN,0,Card,NaN,2235.98
40,585,ruthie@example.org,Schuppe Inc,Crooks,NaN,2015-09-14 18:32:22.682081,2016-04-28 22:58:12.773922,NaN,NaN,0,Card,NaN,1413.03
47,577,bryon@example.com,Jaskolski and Halvorson LLC,Baumbach,NaN,2015-09-14 18:32:22.682081,2019-01-31 16:39:05.131775,NaN,C-00029,0,StripeACH,NaN,2864.60
60,1184,leland@example.org,Gottlieb Group,Ernser,NaN,2016-02-19 15:11:47.247706,2016-02-23 18:09:34.962491,NaN,NaN,0,Card,NaN,3358.67
62,386,monserrat@example.com,Crooks and Weissnat LLC,Walsh,NaN,2015-07-29 16:28:54.045369,2015-11-23 22:40:14.242705,NaN,NaN,0,Card,NaN,2295.56
...,...,...,...,...,...,...,...,...,...,...,...,...,...
4163,4216,sammy@example.net,Kutch and Witting LLC,Marks,NaN,2019-06-04 18:09:54.047178,2019-06-19 18:25:30.393667,NaN,NaN,0,Card,NaN,2313.84
4218,4281,kitty@example.org,Sipes and Kautzer Inc,Rogahn,NaN,2019-08-07 15:44:22.908811,2020-01-05 20:06:11.274711,NaN,NaN,0,StripeACH,NaN,2748.85
4254,4325,virginia@example.com,Corwin and Schinner Inc,Ortiz,NaN,2019-09-12 17:01:10.71147,2019-09-12 17:05:56.076322,NaN,NaN,0,Card,NaN,2902.76
4315,4384,grayson@example.org,Sporer and Stoltenberg Group,Gorczany,NaN,2019-10-24 22:46:05.48029,NaN,NaN,NaN,0,Card,NaN,1198.01
4321,4392,pearl@example.net,Stracke and Hartmann LLC,Nienow,NaN,2019-11-05 16:18:08.109599,2019-11-05 16:45:37.208156,NaN,NaN,0,StripeACH,NaN,1568.29

#### Find rows with the column "name" equal to "Price"

In [31]:
df_copy[df_copy.loc[:, "name"] == "Price"]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
5,574,woodrow@example.com,Kirlin and Sons,Price,NaN,2015-09-14 18:32:22.682081,2016-01-29 17:20:47.232437,NaN,C-00055,0,Card,NaN,34187.06
33,578,althea@example.com,Stehr and Sons,Price,NaN,2015-09-14 18:32:22.682081,2016-03-04 08:30:10.059792,NaN,NaN,0,Card,NaN,2235.98
140,1270,maude@example.com,Keebler Group,Price,NaN,2016-03-16 18:14:51.237674,2016-03-16 20:31:25.852801,NaN,NaN,0,Card,NaN,1378.41
465,380,oscar@example.net,Hilpert and Fadel Group,Price,NaN,2015-07-20 18:14:26.457837,2015-11-23 22:40:14.601536,NaN,NaN,0,Card,NaN,21125.18
990,220,ladarius@example.net,Nolan and Harber Group,Price,NaN,2015-07-01 22:19:34.948958,NaN,NaN,NaN,0,Card,NaN,18852.51
1286,1357,barbara@example.org,Ebert and Vandervort LLC,Price,NaN,2016-04-27 15:54:02.234109,2017-08-24 10:16:44.149274,NaN,NaN,0,StripeACH,NaN,8679.67
2445,2538,ola@example.com,Jakubowski Inc,Price,NaN,2017-05-01 23:58:00.817618,NaN,NaN,NaN,0,Card,NaN,37686.91
3154,3241,floyd@example.com,Simonis Inc,Price,NaN,2018-01-16 18:20:15.674259,2018-08-29 17:34:36.738418,NaN,NaN,0,Card,NaN,2737.24
3446,3429,julian@example.net,Corwin and Aufderhar Inc,Price,NaN,2018-03-27 16:31:51.061198,2018-05-01 19:10:26.257185,NaN,NaN,0,Card,NaN,6557.86

#### Find rows where the "update_at" column is before 2018

In [37]:
df_copy["updated_at"] = pd.to_datetime(df_copy["updated_at"])
df_copy[df_copy["updated_at"] < "2018"]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
0,1038,constantin@example.net,Weissnat Group,Parisian,NaN,2015-12-21 17:00:25.839697,2015-12-22 21:19:23.416702,NaN,NaN,0,Card,NaN,40185.76
2,45,bailey@example.org,Schultz and Hane and Sons,Hilpert,NaN,2015-07-01 22:19:34.948958,2016-01-05 22:54:01.211366,NaN,NaN,0,Card,NaN,11669.36
3,1084,torey@example.com,Lowe and Raynor Group,Olson,NaN,2016-01-13 20:00:45.953792,2016-01-14 19:05:16.638872,NaN,NaN,0,Card,NaN,35833.24
4,1077,felicia@example.org,Dooley and Schumm Group,Pfannerstill,NaN,2016-01-12 20:22:40.84605,2016-01-26 23:25:43.269280,NaN,NaN,0,Card,NaN,46005.43
5,574,woodrow@example.com,Kirlin and Sons,Price,NaN,2015-09-14 18:32:22.682081,2016-01-29 17:20:47.232437,NaN,C-00055,0,Card,NaN,34187.06
...,...,...,...,...,...,...,...,...,...,...,...,...,...
3120,2380,alaina@example.org,Sanford and Grimes and Sons,Ullrich,NaN,2017-03-15 18:40:44.216499,2017-12-20 18:13:11.042439,NaN,NaN,0,Card,NaN,35563.09
3122,3200,fatima@example.org,Bergstrom and Vandervort and Sons,Kulas,NaN,2017-12-20 01:18:53.416321,2017-12-20 20:49:28.498213,NaN,NaN,0,Card,NaN,4399.50
3125,3202,cordia@example.org,Bayer and Gutkowski Group,Ankunding,NaN,2017-12-26 02:06:44.973423,2017-12-26 22:39:57.289622,NaN,NaN,0,Card,NaN,15537.39
3128,3203,calista@example.org,Funk and Okuneva and Sons,Hackett,NaN,2017-12-27 18:25:20.112115,2017-12-27 18:44:30.855417,NaN,NaN,0,Card,NaN,27057.37
3131,3208,norbert@example.net,Turner and Sons,O'Kon,NaN,2017-12-29 18:11:46.261402,2017-12-29 18:45:43.715382,NaN,NaN,0,Card,NaN,48823.09

#### Select the rows where the "name" column is "Hackett" and the "bill_amt" is greater than 25000

In [44]:
df_copy[(df_copy["name"] == "Hackett") & (df_copy["bill_amt"] > 25000)]

,id,email,company_name,name,notes,created_at,updated_at,deleted_at,intacct_id,bill_day,source,address,bill_amt
467,342,destiny@example.org,Wilderman and Gutmann Group,Hackett,NaN,2015-07-01 22:19:34.948958,2015-11-23 22:40:14.825390,NaN,NaN,0,Card,NaN,34206.49
1197,1036,filomena@example.com,Hackett LLC,Hackett,NaN,2015-12-17 19:27:49.687774,2016-01-26 23:09:49.544815,NaN,NaN,0,Card,NaN,49101.48
1885,1968,ena@example.org,Crist Group,Hackett,NaN,2016-11-30 13:27:05.706326,2017-03-03 23:03:02.816556,NaN,NaN,0,Card,NaN,42043.39
3128,3203,calista@example.org,Funk and Okuneva and Sons,Hackett,NaN,2017-12-27 18:25:20.112115,2017-12-27 18:44:30.855417,NaN,NaN,0,Card,NaN,27057.37
3300,3377,roberto@example.net,Wilkinson and Sons,Hackett,NaN,2018-03-05 21:27:28.998816,2018-03-06 19:58:19.822635,NaN,NaN,0,Card,NaN,41641.81
3631,3782,rowan@example.net,Nolan and Herzog LLC,Hackett,NaN,2018-09-08 16:49:34.537627,NaT,NaN,NaN,0,Card,NaN,40683.06

### 5. Transforming a DataFrame

Note: After transforming a DataFrame it is good practice to display the transformed DataFrame to ensure that the expected changes were made. This can be done by viewing the top rows of the DataFrame or by checking specific rows that you are concerned with.

#### View the top rows before making any changes

#### Drop the "address" column from your DataFrame and check your results

#### Drop all columns with Nan values

#### Create a new column named "original_account" filled with the value "yes"

#### Add 10000 to the "bill_amt" for all rows

### 6. Save you DataFrame to a new CSV file in your data folder called "clean_payers.csv"

#### Check that "clean_payers.csv" was properly saved to your computer